---
title: DWGImportOptions
classe: Autodesk.Revit.DB.DWGImportOptions
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.BaseImportOptions
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# DWGImportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `IList<Int32> GetLineWeights()` | `dWGImportOptions.GetLineWeights()` | IList<Int32> |
| `Void SetLineWeights(IList<Int32>)` | `dWGImportOptions.SetLineWeights(lineWeight)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```